app/views/users/show.html.erb


    <p class="text-muted">これまでのランチ投稿：<%= @user.posts.count %>件</p>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 2]]