app/views/posts/index.html.erb

      <div class="col-6 col-md-3">
        <%= f.collection_select :dish_id, Dish.all, :id, :name, { prompt: "料理名を選択", selected: params[:dish_id] }, { class: "form-select" } %>
---
SELECT "dishes".* FROM "dishes"

      <div class="col-6 col-md-3">
        <%= f.select :cuisine, Dish.pluck(:cuisine).uniq, { prompt: "ジャンルを選択", selected: params[:cuisine] }, { class: "form-select" } %>
---
SELECT "dishes"."cuisine" FROM "dishes"