app/controllers/choices_controller.rb

  def create
    dish = Dish.find(params[:dish_id])
    @choice = current_user.choices.build(
      dish: dish,
      cuisin_at_choice: dish.cuisine,
      main_dish_at_choice: dish.main_dish,
    )

    if @choice.save
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "choices" ("user_id", "dish_id", "cuisin_at_choice", "main_dish_at_choice", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["dish_id", 11], ["cuisin_at_choice", "和食"], ["main_dish_at_choice", "麺"], ["created_at", "2025-11-12 17:34:17.727718"], ["updated_at", "2025-11-12 17:34:17.727718"]]