app/controllers/choices_controller.rb

  def index
    @choices = current_user.choices.includes(:dish).order(created_at: :desc)

    dish_counts = current_user.choices.joins(:dish).group("dishes.name").count

    if dish_counts.present?
---
SELECT "choices".* FROM "choices" WHERE "choices"."user_id" = $1 ORDER BY "choices"."created_at" DESC  [["user_id", 1]]
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" IN ($1, $2)  [["id", 56], ["id", 11]]
SELECT COUNT(*) AS "count_all", "dishes"."name" AS "dishes_name" FROM "choices" INNER JOIN "dishes" ON "dishes"."id" = "choices"."dish_id" WHERE "choices"."user_id" = $1 GROUP BY "dishes"."name"  [["user_id", 2]]

  def create
    dish = Dish.find(params[:dish_id])
    @choice = current_user.choices.build(
      dish: dish,
      cuisin_at_choice: dish.cuisine,
      main_dish_at_choice: dish.main_dish,
    )

    if @choice.save
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "choices" ("user_id", "dish_id", "cuisin_at_choice", "main_dish_at_choice", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["dish_id", 11], ["cuisin_at_choice", "和食"], ["main_dish_at_choice", "麺"], ["created_at", "2026-01-12 19:19:50.825736"], ["updated_at", "2026-01-12 19:19:50.825736"]]