app/controllers/dishes_controller.rb

  def index
    cuisine = params[:cuisine]
    main_dish = params[:main_dish]

    if cuisine.present? && main_dish.present?
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."cuisine" = $1 AND "dishes"."main_dish" = $2  [["cuisine", "和食"], ["main_dish", "麺"]]
SELECT 1 AS one FROM "dishes" WHERE "dishes"."cuisine" = $1 AND "dishes"."main_dish" = $2 LIMIT $3  [["cuisine", "和食"], ["main_dish", "麺"], ["LIMIT", 1]]