app/controllers/posts_controller.rb

  def index
    @posts = Post.all.includes(:user, :dish).order(created_at: :desc)

    if params[:query].present?
      @posts = @posts.joins(:dish).where("dishes.name LIKE ?", "%#{params[:query]}%")
    end

    if params[:dish_id].present?
      @posts = @posts.where(dish_id: params[:dish_id])
    end

    if params[:cuisine].present?
      @posts = @posts.joins(:dish).where(dishes: { cuisine: params[:cuisine] })
    end

    @posts = @posts.page(params[:page]).per(10)
---
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" IN ($1, $2)  [["id", 1], ["id", 51]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 2], ["id", 1]]
SELECT "dishes".* FROM "dishes" WHERE "dishes"."id" = $1  [["id", 51]]
SELECT "posts".* FROM "posts" WHERE "posts"."dish_id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2 OFFSET $3  [["dish_id", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 1]]

  def new
    @post = current_user.posts.build
    @dishes = Dish.all
---
SELECT "dishes".* FROM "dishes"

  def create
    @post = current_user.posts.build(post_params)

    if @post.save
      redirect_to posts_path, notice: '新しいランチを投稿しました！'
    else
      @dishes = Dish.all
---
INSERT INTO "posts" ("comment", "user_id", "dish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", nil], ["user_id", 2], ["dish_id", 1], ["created_at", "2026-01-13 03:39:33.816913"], ["updated_at", "2026-01-13 03:39:33.816913"]]
SELECT "dishes".* FROM "dishes"

  def edit
    @dishes = Dish.all
---
SELECT "dishes".* FROM "dishes"

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "dish_id" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["dish_id", 17], ["updated_at", "2026-01-12 16:42:06.558287"], ["id", 2]]