app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    if @post.save
---
INSERT INTO "posts" ("comment", "user_id", "dish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", nil], ["user_id", 2], ["dish_id", 1], ["created_at", "2025-12-28 04:27:35.476276"], ["updated_at", "2025-12-28 04:27:35.476276"]]