app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2 OFFSET $3  [["user_id", 2], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 2]]
---
  def show
    @user = User.find(params[:id])
    @posts = @user.posts.includes(:dish).order(created_at: :desc).page(params[:page]).per(10)